## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.terraform-azure-collection.azurerm_linux_function_app.observe_collect_function_app will be updated in-place
  ~ resource "azurerm_linux_function_app" "observe_collect_function_app" {
      ~ app_settings                                   = {
          ~ "timer_resources_func_schedule"                 = "0 */3 * * * *" -> "0 */10 * * * *"
            # (13 unchanged elements hidden)
        }
        id                                             = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-CS-770/providers/Microsoft.Web/sites/gh-fa-nikhil-CS-770"
        name                                           = "gh-fa-nikhil-CS-770"
        tags                                           = {
            "branch"     = "nikhil-CS-770"
            "created_by" = "terraform-ci"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.terraform-azure-collection.azurerm_role_assignment.observe_role_assignment will be created
  + resource "azurerm_role_assignment" "observe_role_assignment" {
      + condition                        = <<-EOT
            ( 
              (
              resource.resourceType == 'Microsoft.Web/sites/functions' &&
              resource.name == 'gh-fa-main'
              )
            )
        EOT
      + condition_version                = "2.0"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "da7482c0-e476-47d2-8755-25dd369e4421"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/080291cf-8419-427c-953c-944e6c351029"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>